
&НаСервере
Процедура бит_омни_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаБИТМедицинаОмни = Элементы.Вставить("бит_омни_ГруппаЭлементов", Тип("ГруппаФормы"), ЭтотОбъект, Элементы.ГруппаСтраницы);
	ГруппаБИТМедицинаОмни.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаБИТМедицинаОмни.Заголовок = "БИТ.Медицина / Омни";

	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_НаименованиеДляСайта", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_НаименованиеДляСайта";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеВвода;

	ЭлементТипЗаписи = Элементы.Добавить("бит_омни_ТипЗаписи", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементТипЗаписи.ПутьКДанным = "Объект.бит_омни_ТипЗаписи";
	ЭлементТипЗаписи.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементТелефонДляЗаписи = Элементы.Добавить("бит_омни_ТелефонДляЗаписи", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементТелефонДляЗаписи.ПутьКДанным = "Объект.бит_омни_ТелефонДляЗаписи";
	ЭлементТелефонДляЗаписи.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_ИконкаСпециализации", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_ИконкаСпециализации";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементНеВыгружать = Элементы.Добавить("бит_омни_НеВыгружать", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементНеВыгружать.ПутьКДанным = "Объект.бит_омни_НеВыгружать";
	ЭлементНеВыгружать.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементНеВыгружать.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	
КонецПроцедуры
