
&После("УстановкаПараметровСеанса")
Процедура бит_омни_УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если ТребуемыеПараметры <> Неопределено
		И (ТребуемыеПараметры.Найти("бит_омни_ОтделениеПользователяMAX") <> Неопределено
			Или ТребуемыеПараметры.Найти("бит_омни_ПолныеПраваMAX") <> Неопределено) Тогда
		бит_омни_ОтделенияMAXСервер.УстановитьПараметрыДоступаСеанса();
	КонецЕсли;
	
	Если ТребуемыеПараметры <> Неопределено 
		И ТребуемыеПараметры.Найти("бит_омни_КешОбъектовДляРассылки") <> Неопределено
	Тогда
		Кеш = бит_омни_ОбщегоНазначения.ПолучитьСписокОбъектовДляРассылок();
		бит_омни_ОбщегоНазначения.УстановитьКешОбъектовДляРассылок(Кеш);
	КонецЕсли;
	
КонецПроцедуры
