#Область ПрограммныйИнтерфейс

Функция БотПоИдентификатору(ИдентификаторБота) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_омни_Боты.Ссылка КАК Ссылка,
	|	бит_омни_Боты.Токен КАК Токен,
	|	бит_омни_Боты.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.бит_омни_Боты КАК бит_омни_Боты
	|ГДЕ
	|	бит_омни_Боты.Идентификатор = &Идентификатор
	|	И бит_омни_Боты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)
	|	И НЕ бит_омни_Боты.ПометкаУдаления
	|	И бит_омни_Боты.Использовать";
	
	Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Строка(ИдентификаторБота)));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураБота = Новый Структура("Ссылка, Токен, Идентификатор");
		ЗаполнитьЗначенияСвойств(СтруктураБота, Выборка);
		Возврат СтруктураБота;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДанныеБота(Бот) Экспорт
	
	Если ТипЗнч(Бот) = Тип("Структура") Тогда
		Возврат Бот;
	КонецЕсли;
	
	Если ТипЗнч(Бот) = Тип("СправочникСсылка.бит_омни_Боты") Тогда
		
		Если Бот.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РеквизитыБота = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Бот, "Токен, Идентификатор");
		Возврат Новый Структура("Ссылка, Токен, Идентификатор", Бот, РеквизитыБота.Токен, РеквизитыБота.Идентификатор);
		
	КонецЕсли;
	
	Если ТипЗнч(Бот) = Тип("СправочникОбъект.бит_омни_Боты") Тогда
		Возврат Новый Структура("Ссылка, Токен, Идентификатор", Бот.Ссылка, Бот.Токен, Бот.Идентификатор);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СоединениеCAPI() Экспорт
	
	СтруктураURIВебСервиса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресAPI());
	Сервер = СтруктураURIВебСервиса.ИмяСервера;
	Порт = ?(ЗначениеЗаполнено(СтруктураURIВебСервиса.Порт), СтруктураURIВебСервиса.Порт, Неопределено);
	Прокси = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		Прокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURIВебСервиса.Схема);
	КонецЕсли;
	
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	HTTPСоединение = Новый HTTPСоединение(Сервер, Порт,,, Прокси,, ЗащищенноеСоединение);
	
	Возврат HTTPСоединение;
	
КонецФункции

Функция ОбработчикКоманды(Команда) Экспорт
	
	Соответствие = СоответствиеОбработчиковКоманд();
	Обработчик = Соответствие.Получить(Команда);
	
	Если Обработчик = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Обработчик;
	
КонецФункции

Функция ОбработчикСообщения() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресAPI()
	
	Возврат "https://platform-api2.max.ru/";
	
КонецФункции

Функция СоответствиеОбработчиковКоманд()
	
	Соответствие = Новый Соответствие;
	
	// Соответствие.Вставить("start", "ИмяОбработчикаКомандыStart");
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти
