Функция бит_омни_ДанныеДокументов(HTTPЗапрос) Экспорт
	
	ТипПоиска = HTTPЗапрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеопределенТипПоиска();	
	ИначеЕсли ТипПоиска = "ByPatient" Тогда                                     
		ИдентификаторПациента = HTTPЗапрос.ПараметрыЗапроса.Получить("patient_id");
		Возврат бит_омни_ПриемыПоПациенту(ИдентификаторПациента);
	ИначеЕсли ТипПоиска = "ByID" Тогда
		ИдентификаторПациента = HTTPЗапрос.ПараметрыЗапроса.Получить("medicalId");
		Возврат бит_омни_ПриемПоUUID(ИдентификаторПациента);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции

Функция бит_омни_ПриемыПоПациенту(ИдентификаторПациента)	                                                        
	
	Если ИдентификаторПациента = Неопределено Тогда
		Возврат Справочники.Клиенты.бит_омни_НеопределенИдентификатор();
	КонецЕсли;	                                                        
	
	Клиент = Справочники.Клиенты.бит_омни_ПациентПоUUID(ИдентификаторПациента, Истина);
	
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.Клиенты") Тогда
		Возврат Клиент; // функция может вернуть только HTTPСервисОтвет или СправочникСсылка.Клиенты
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	Прием.Ссылка КАК Ссылка,
	|	Прием.Клиент КАК Клиент,
	|	Прием.Врач КАК Врач,
	|	Прием.Филиал КАК Филиал,
	|	Прием.Дата КАК Дата
	|ПОМЕСТИТЬ ДанныеПриемов
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Клиент = &Клиент
	|	И Прием.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПриемов.Ссылка)) КАК medicalId,
	|	ДанныеПриемов.Дата КАК date,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПриемов.Врач)) КАК doctorId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПриемов.Врач) КАК doctorTitle,
	|	Сотрудники.Фамилия КАК doctorLastname,
	|	Сотрудники.Имя КАК doctorFirstname,
	|	Сотрудники.Отчество КАК doctorPatronymic,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПриемов.Филиал)) КАК branchId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПриемов.Филиал) КАК branchTitle,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Сотрудники.Специализация)) КАК specializationId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Сотрудники.Специализация) КАК specializationTitle,
	|	Прием.Работы.(
	|		ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Прием.Работы.Номенклатура)) КАК serviceId,
	|		ПРЕДСТАВЛЕНИЕССЫЛКИ(Прием.Работы.Номенклатура) КАК serviceTitle
	|	) КАК servicesList,
	|	ВЫБОР
	|		КОГДА КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone)
	|			ТОГДА ""phone""
	|		КОГДА КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone_and_chat)
	|			ТОГДА ""phone_and_chat""
	|		ИНАЧЕ ""online""
	|	КОНЕЦ КАК specializationType,
	|	КатегорииВыработки.бит_омни_ТелефонДляЗаписи КАК specializationPhone
	|ИЗ
	|	ДанныеПриемов КАК ДанныеПриемов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииВыработки КАК КатегорииВыработки
	|			ПО Сотрудники.Специализация = КатегорииВыработки.Ссылка
	|		ПО ДанныеПриемов.Врач = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
	|		ПО ДанныеПриемов.Ссылка = Прием.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	date УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	
	ТелоЗапроса = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеЗапроса);
	Для Каждого СтрокаПриема Из ТелоЗапроса Цикл
		СтрокаПриема.servicesList = ОбщегоНазначения.ТаблицаЗначенийВМассив(СтрокаПриема.servicesList);	
	КонецЦикла; 
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса);

КонецФункции

Функция бит_омни_ПриемПоUUID(ИдентификаторПациента)



КонецФункции
