#Область ПрограммныйИнтерфейс

Функция бит_омни_ДанныеСправочника(Запрос) Экспорт

	ТипПоиска = Запрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеопределенТипПоиска();	
	ИначеЕсли ТипПоиска = "ByPhone" Тогда
		НомерТелефона = Запрос.ПараметрыЗапроса.Получить("phone");                                     
		Возврат бит_омни_КлиентыПоНомеруТелефона(НомерТелефона);
	ИначеЕсли ТипПоиска = "ByID" Тогда
		Идентификатор = Запрос.ПараметрыЗапроса.Получить("patient_id");
		Возврат бит_омни_ПациентПоUUID(Идентификатор);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция бит_омни_ПациентПоUUID(Знач Идентификатор, ВернутьСсылку = Ложь) Экспорт
		
	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(Идентификатор, "patient_id");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Клиент = ПолучитьСсылку(Идентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Клиент) Тогда
		Возврат бит_омни_НеНайденКлиент();
	КонецЕсли;
	
	Если ВернутьСсылку Тогда
		Возврат Клиент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Клиенты.Ссылка)) КАК id,
	|	Клиенты.Фамилия + "" "" + Клиенты.Имя + "" "" + Клиенты.Отчество КАК fullName,
	|	Клиенты.ДатаРождения КАК birthDate,
	|	ЕСТЬNULL(НакопленияПоСкидкамОстатки.НакоплениеОстаток, 0) КАК bonus
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НакопленияПоСкидкам.Остатки(
	|				&ТекущаяДата,
	|				Получатель = &Клиент
	|					И ВидСкидки.ТипСкидки = ЗНАЧЕНИЕ(Перечисление.ТипыСкидок.Бонусы)) КАК НакопленияПоСкидкамОстатки
	|		ПО (НакопленияПоСкидкамОстатки.Получатель = Клиенты.Ссылка)
	|ГДЕ
	|	Клиенты.Ссылка = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДанныеПациента = Новый Структура("id, fullName, birthDate, bonus");
		ЗаполнитьЗначенияСвойств(ДанныеПациента, Выборка);
		
		Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ДанныеПациента);
	Иначе                                 
		
		Возврат бит_омни_НеНайденКлиент();
		
	КонецЕсли;

КонецФункции
	
Функция бит_омни_НеопределенИдентификатор() Экспорт

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("patient_id_required");	

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бит_омни_НеопределенНомерТелефона()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("phone_required");	

КонецФункции

Функция бит_омни_НеверныйИдентификатор()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("invalid_patient_id");	

КонецФункции

Функция бит_омни_НеНайденКлиент()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("patients_not_found", 404);	

КонецФункции

Функция бит_омни_КлиентыПоНомеруТелефона(НомерТелефона)
	
	Если НомерТелефона = Неопределено Тогда
		Возврат бит_омни_НеопределенНомерТелефона();	
	КонецЕсли;
	
	ВидКонтактнойИнформации_ДляПоиска = бит_омни_ОбщегоНазначенияПолныеПрава.ЗначениеКонстанты("ВидКонтактнойИнформации_ДляПоискаКлиента");
		
	КлиентыПоНомеруТелефона = 
		бит_омни_КонтактнаяИнформацияСерверПереопределяемый.НайтиОбъектыПоНомеруТелефона(НомерТелефона, 
			Тип("СправочникСсылка.Клиенты"), Истина, ВидКонтактнойИнформации_ДляПоиска);
			
	Если КлиентыПоНомеруТелефона.Количество() = 0 Тогда
		Возврат бит_омни_НеНайденКлиент();	
	КонецЕсли;
	
	Реквизиты = Новый Структура("id, fullName, birthDate", 
		"ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Ссылка))", "Фамилия + "" "" + Имя + "" "" + Отчество", "ДатаРождения");
	
	СписокКлиентов = Новый Массив;
	Для Каждого Контакт Из КлиентыПоНомеруТелефона Цикл
		СписокКлиентов.Добавить(Контакт.Объект);
	КонецЦикла;
	ДанныеПациентов = бит_омни_ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокКлиентов, Реквизиты, Истина);
	
	ТелоОтвета = Новый Массив;
	Для Каждого Пациент Из ДанныеПациентов Цикл
		ТелоОтвета.Добавить(Пациент.Значение);
	КонецЦикла;
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);

КонецФункции
	
#КонецОбласти                      

 
