Функция бит_омни_ДанныеСправочника(Запрос) Экспорт

	ТипПоиска = Запрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ДанныеШаблоновАнкет();
	ИначеЕсли ТипПоиска = "ByID" Тогда       
		ИдентификаторШаблона = Запрос.ПараметрыЗапроса.Получить("surveyTemplateId");
		Если ИдентификаторШаблона = Неопределено Тогда
			Возврат бит_омни_НеНайденИдентификатор();	
		КонецЕсли;
		Возврат бит_омни_ДанныеШаблоновАнкет(ИдентификаторШаблона);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции 

Функция бит_омни_ДанныеШаблоновАнкет(ИдентификаторШаблона = Неопределено, ВернутьСсылку = Ложь) Экспорт
	
	Если ИдентификаторШаблона <> Неопределено Тогда
		РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(ИдентификаторШаблона, "surveyTemplateId");
		
		Если РезультатПроверки <> Неопределено Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		ШаблонАнкеты = ПолучитьСсылку(ИдентификаторШаблона);
		Если НЕ ОбщегоНазначения.СсылкаСуществует(ШаблонАнкеты) Тогда
			Возврат бит_омни_НеНайденШаблонАнкеты();
		КонецЕсли;
		
		Если ВернутьСсылку Тогда
			Возврат ШаблонАнкеты;
		КонецЕсли;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Владелец)) КАК surveyTemplateId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВопросыШаблонаАнкеты.Владелец) КАК surveyTemplateTitle,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Ссылка)) КАК questionId,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Родитель)) КАК questionParent,
	|	ВопросыШаблонаАнкеты.ЭтоГруппа КАК isSection,
	|	ВопросыШаблонаАнкеты.Наименование КАК questionTitle,
	|	ВопросыШаблонаАнкеты.Формулировка КАК questionWording,
	|	ВопросыШаблонаАнкеты.Обязательный КАК isRequired,
	|	ВопросыШаблонаАнкеты.Подсказка КАК questionHelpDescription,
	|	ПРЕДСТАВЛЕНИЕ(ВопросыДляАнкетирования.ТипЗначения) КАК answerTypeInInfobase,
	|	ВЫБОР
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Булево)
	|			ТОГДА ""boolean""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Строка)
	|			ТОГДА ""string""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Текст)
	|			ТОГДА ""text""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Число)
	|			ТОГДА ""number""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ЗначениеИнформационнойБазы)
	|			ТОГДА ""valueInInfoBase""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ОдинВариантИз)
	|			ТОГДА ""oneValueFrom""
	|		КОГДА ВопросыДляАнкетирования.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.НесколькоВариантовИз)
	|			ТОГДА ""severalValuesFrom""
	|	КОНЕЦ КАК answerType,
	|	ВопросыДляАнкетирования.ТребуетсяКомментарий КАК requiresComment,
	|	ВопросыДляАнкетирования.ПояснениеКомментария КАК commentDescription,
	|	ВопросыДляАнкетирования.Длина КАК constraint_lenght,
	|	ВопросыДляАнкетирования.МинимальноеЗначение КАК constraint_min,
	|	ВопросыДляАнкетирования.МаксимальноеЗначение КАК constraint_max,
	|	ВопросыДляАнкетирования.Точность КАК constraint_decimal,
	|	ВЫБОР
	|		КОГДА ВопросыДляАнкетирования.ВидПереключателя = ЗНАЧЕНИЕ(Перечисление.ВидыПереключателяВАнкетах.Переключатель)
	|			ТОГДА ""selector""
	|		ИНАЧЕ ""toggle""
	|	КОНЕЦ КАК selector_type,
	|	ВЫБОР
	|		КОГДА ВопросыДляАнкетирования.ВидФлажка = ЗНАЧЕНИЕ(Перечисление.ВидыФлажкаВАнкетах.ПолеВвода)
	|			ТОГДА ""input""
	|		ИНАЧЕ ""switch""
	|	КОНЕЦ КАК flag_type,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВариантыОтветовАнкет.Ссылка)) КАК answerId,
	|	ВариантыОтветовАнкет.Наименование КАК answerTItle,
	|	ВариантыОтветовАнкет.ТребуетОткрытогоОтвета КАК requiresOpenAnswer
	|ИЗ
	|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
	|			ПО (ВариантыОтветовАнкет.Владелец = ВопросыДляАнкетирования.Ссылка)
	|				И (НЕ ВариантыОтветовАнкет.ПометкаУдаления)
	|		ПО ВопросыШаблонаАнкеты.ЭлементарныйВопрос = ВопросыДляАнкетирования.Ссылка
	|ГДЕ
	|	&УсловияПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВопросыШаблонаАнкеты.Код,
	|	ВариантыОтветовАнкет.Код,
	|	ВариантыОтветовАнкет.РеквизитДопУпорядочивания
	|ИТОГИ ПО
	|	ВопросыШаблонаАнкеты.Владелец,
	|	ВопросыШаблонаАнкеты.Ссылка,
	|	ВопросыДляАнкетирования.Ссылка";
	
	Если ЗначениеЗаполнено(ШаблонАнкеты) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияПоиска", "ВопросыШаблонаАнкеты.Владелец =  &ШаблонАнкеты");
		Запрос.УстановитьПараметр("ШаблонАнкеты", ШаблонАнкеты);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияПоиска", "НЕ ВопросыШаблонаАнкеты.ПометкаУдаления");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанныеШаблонаАнкеты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТелоОтвета = Новый Массив;
	Пока ВыборкаДанныеШаблонаАнкеты.Следующий() Цикл
		ДанныеАнкеты = Новый Структура("surveyTemplateId, surveyTemplateTitle, questionItems");
		ЗаполнитьЗначенияСвойств(ДанныеАнкеты, ВыборкаДанныеШаблонаАнкеты);
		
		ДанныеАнкеты.questionItems = Новый Массив;
		
		ВыборкаВопросыШаблона = ВыборкаДанныеШаблонаАнкеты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВопросыШаблона.Следующий() Цикл
			ДанныеВопроса = Новый Структура("questionId, questionParent, isSection, questionTitle, questionWording, isRequired, questionHelpDescription, questionOptions");
			
			ЗаполнитьЗначенияСвойств(ДанныеВопроса, ВыборкаВопросыШаблона);
			
			Если ДанныеВопроса.isSection Тогда
				ДанныеВопроса.isRequired = Неопределено;
				ДанныеВопроса.questionHelpDescription = Неопределено;
				ДанныеВопроса.questionOptions = Новый Структура;
				Продолжить;
			КонецЕсли;
			
			ВыборкаСвойстваВопроса = ВыборкаВопросыШаблона.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСвойстваВопроса.Следующий() Цикл
				СвойстваВопроса = Новый Структура("answerTypeInInfobase, answerType, requiresComment, commentDescription, constraints, selector_type, flag_type, answerEndpoint, answerEndpoint_IdOption, answerEndpoint_TitleOption, answerItems");
				ЗаполнитьЗначенияСвойств(СвойстваВопроса, ВыборкаСвойстваВопроса);
				СвойстваВопроса.constraints = Новый Структура;
				Если СвойстваВопроса.answerType = "string" ИЛИ СвойстваВопроса.answerType = "number" Тогда
					СвойстваВопроса.constraints.Вставить("lenght", ВыборкаСвойстваВопроса.constraint_lenght);
				КонецЕсли;                                                                                   
				
				Если СвойстваВопроса.answerType = "number" Тогда
					СвойстваВопроса.constraints.Вставить("minValue", ВыборкаСвойстваВопроса.constraint_min);	
					СвойстваВопроса.constraints.Вставить("maxValue", ВыборкаСвойстваВопроса.constraint_max);	
					СвойстваВопроса.constraints.Вставить("decimal", ВыборкаСвойстваВопроса.constraint_decimal);
				КонецЕсли;
				
				СвойстваВопроса.answerItems = Новый Массив;
				
				Если СвойстваВопроса.answerTypeInInfobase = "Пол физических лиц" Тогда
					СвойстваВопроса.answerEndpoint = ОбщегоНазначенияКлиентСервер.НовыйМассив("Мужской", "Женский");
				КонецЕсли;
				
				Если СвойстваВопроса.answerTypeInInfobase = "Клиника" Тогда
					СвойстваВопроса.answerEndpoint = "/catalogs/branches/";
					СвойстваВопроса.answerEndpoint_IdOption = "branchId";
					СвойстваВопроса.answerEndpoint_TitleOption = "branchTitle";
				КонецЕсли;
				
				Если СвойстваВопроса.answerTypeInInfobase = "Сотрудник" Тогда
					СвойстваВопроса.answerEndpoint = "/catalogs/employees/";
					СвойстваВопроса.answerEndpoint_IdOption = "doctorId";
					СвойстваВопроса.answerEndpoint_TitleOption = "doctorTitle";
				КонецЕсли;
				
				Если СвойстваВопроса.answerTypeInInfobase = "Специализация" Тогда
					СвойстваВопроса.answerEndpoint = "/catalogs/employees/?search_type=BySchedule";
					СвойстваВопроса.answerEndpoint_IdOption = "specializationId";
					СвойстваВопроса.answerEndpoint_TitleOption = "specializationTitle";
				КонецЕсли;
				
				ВыборкаОтветы = ВыборкаСвойстваВопроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаОтветы.Следующий() Цикл
					Если ВыборкаОтветы.answerId = null Тогда
						Продолжить;
					КонецЕсли;
					ДанныеОтвета = Новый Структура("answerId, answerTitle, requiresOpenAnswer");
					ЗаполнитьЗначенияСвойств(ДанныеОтвета, ВыборкаОтветы);
					СвойстваВопроса.answerItems.Добавить(ДанныеОтвета);
				КонецЦикла;
				
				ДанныеВопроса.questionOptions = СвойстваВопроса;
				
			КонецЦикла;
			
			ДанныеАнкеты.questionItems.Добавить(ДанныеВопроса);
		КонецЦикла;
		ТелоОтвета.Добавить(ДанныеАнкеты);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ШаблонАнкеты) Тогда
		Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ДанныеАнкеты);
	Иначе
		Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);
	КонецЕсли;
	
КонецФункции

Функция бит_омни_НеНайденИдентификатор()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("surveyTemplateId_required");

КонецФункции

Функция бит_омни_НеНайденШаблонАнкеты()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("surveyTemplate_not_found", 404);

КонецФункции // бит_омни_НеНайденШаблонАнкеты()


