#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульБазовыеПодсистемы = ОбщегоНазначения.ОбщийМодуль("бит_омни_ОбщегоНазначения");
	
	ТипСКД = МодульБазовыеПодсистемы.ОписаниеТиповСхемыКомпоновкиДанных();
	Элементы.Получатели.ОграничениеТипа = ТипСКД;
	Элементы.Контекст.ОграничениеТипа = ТипСКД;

	ЗаполнитьСписокВыбораПринадлежности();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Получатели = ТекущийОбъект.СКДПолучатели.Получить();
	Контекст = ТекущийОбъект.СКДКонтекст.Получить();
	Расписание = ТекущийОбъект.Расписание.Получить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Расписание = Неопределено Тогда
		Расписание = РасписаниеРЗ();        
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СКДПолучатели = Новый ХранилищеЗначения(Получатели);
	ТекущийОбъект.СКДКонтекст = Новый ХранилищеЗначения(Контекст);
	ТекущийОбъект.Расписание = Новый ХранилищеЗначения(Расписание);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимРассылкиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьРасписание(Команда)

	ДиалогРедактированияРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	Оповещение = Новый ОписаниеОповещения("РедактироватьРасписаниеЗавершение", ЭтаФорма); 
	ДиалогРедактированияРасписания.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РасписаниеРЗ()
	
	Расписание = Новый РасписаниеРегламентногоЗадания();
	Расписание.ПериодПовтораДней = 1;
	Расписание.ДатаНачала = ТекущаяДата();
	Расписание.ПериодПовтораВТечениеДня = 0;
	Расписание.ДниНедели.Добавить(1);
	Расписание.ДниНедели.Добавить(2);
	Расписание.ДниНедели.Добавить(3);
	Расписание.ДниНедели.Добавить(4);
	Расписание.ДниНедели.Добавить(5);
	Расписание.ДниНедели.Добавить(6);
	Расписание.ДниНедели.Добавить(7);
	
	Возврат Расписание;
	
КонецФункции

&НаКлиенте
Процедура РедактироватьРасписаниеЗавершение(РасписаниеНовое, ДополнительныеПараметры) Экспорт

	Расписание = РасписаниеНовое;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ПоРасписание = ПредопределенноеЗначение("Перечисление.бит_омни_РежимыРассылки.ПоРасписанию");
	РежимПоРасписанию = (Объект.РежимРассылки = ПоРасписание);
	
	Элементы.РедактироватьРасписание.Видимость = РежимПоРасписанию;
	Элементы.ГруппаПринадлежность.Видимость = НЕ РежимПоРасписанию;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПринадлежности()
	
	ЗаполнитьСписокВыбораПоМетаданным(Метаданные.Справочники, БиблиотекаКартинок.Справочник);	
	ЗаполнитьСписокВыбораПоМетаданным(Метаданные.Документы, БиблиотекаКартинок.Документ);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоМетаданным(МетаданныеКоллекция, Картинка)
	
	СписокВыбора = Элементы.ПринадлежностьОбъект.СписокВыбора;
	
	Для Каждого МетаданныеЭлементКоллекции Из МетаданныеКоллекция Цикл
		СписокВыбора.Добавить(МетаданныеЭлементКоллекции.ПолноеИмя(), 
							  МетаданныеЭлементКоллекции.Представление(),,Картинка)
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

