Функция бит_омни_ДанныеСправочника(Запрос) Экспорт

	ТипПоиска = Запрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеопределенТипПоиска();	
	ИначеЕсли ТипПоиска = "BySchedule" Тогда                                     
		Возврат бит_омни_СпециализацииЗадействованныеВРасписании();
	ИначеЕсли ТипПоиска = "ByID" Тогда
		Идентификатор = Запрос.ПараметрыЗапроса.Получить("specializationId");
		Возврат бит_омни_СпециализацияПоUUID(Идентификатор);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции

Функция бит_омни_СпециализацииЗадействованныеВРасписании()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	СотрудникиСпециализации.Специализация КАК Специализация
	|ПОМЕСТИТЬ СпециализацииСотрудниковКалендаря
	|ИЗ
	|	Справочник.Сотрудники.Специализации КАК СотрудникиСпециализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СотрудникиСпециализации.Ссылка = Сотрудники.Ссылка
	|ГДЕ
	|	Сотрудники.УчаствуетВКалендарномПланировании
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Архив
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И НЕ СотрудникиСпециализации.Специализация.бит_омни_НеВыгружать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпециализацииСотрудниковКалендаря.Специализация КАК Специализация
	|ПОМЕСТИТЬ ОтфильтрованныеСпециализации
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпециализацииСотрудниковКалендаря КАК СпециализацииСотрудниковКалендаря
	|		ПО ГрафикиРаботы.Сотрудник = СпециализацииСотрудниковКалендаря.Сотрудник
	|ГДЕ
	|	ГрафикиРаботы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КатегорииВыработки.Ссылка КАК Специализация
	|ИЗ
	|	Справочник.КатегорииВыработки КАК КатегорииВыработки
	|ГДЕ
	|	НЕ КатегорииВыработки.бит_омни_НеВыгружать
	|	И НЕ КатегорииВыработки.ПометкаУдаления
	|	И (КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone)
	|	ИЛИ КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone_and_chat))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОтфильтрованныеСпециализации.Специализация)) КАК specializationId,
	|	ВЫБОР КОГДА КатегорииВыработки.бит_омни_НаименованиеДляСайта <> """" ТОГДА
	|		КатегорииВыработки.бит_омни_НаименованиеДляСайта
	|	ИНАЧЕ
	|		ПРЕДСТАВЛЕНИЕССЫЛКИ(ОтфильтрованныеСпециализации.Специализация)
	|	КОНЕЦ КАК specializationTitle,
	|	ВЫБОР
	|		КОГДА КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone)
	|			ТОГДА ""phone""
	|		КОГДА КатегорииВыработки.бит_омни_ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.бит_омни_ТипыЗаписи.phone_and_chat)
	|			ТОГДА ""phone_and_chat""
	|		ИНАЧЕ ""online""
	|	КОНЕЦ КАК appointment_type,
	|	КатегорииВыработки.бит_омни_ИконкаСпециализации КАК iconCode,
	|	КатегорииВыработки.бит_омни_ТелефонДляЗаписи КАК appointment_phone
	|ИЗ
	|	ОтфильтрованныеСпециализации КАК ОтфильтрованныеСпециализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииВыработки КАК КатегорииВыработки
	|		ПО ОтфильтрованныеСпециализации.Специализация = КатегорииВыработки.Ссылка";
	
	Сегодня = НачалоДня(ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(Сегодня, -1));
	Запрос.УстановитьПараметр("ДатаОкончания", ДобавитьМесяц(Сегодня, 1));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	
	ТелоЗапроса = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеЗапроса);
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса, "бит_омни_ПреобразоватьВJSON", Справочники.КатегорииВыработки);
	
	
КонецФункции

Функция бит_омни_СпециализацияПоUUID(Знач Идентификатор, ВернутьСсылку = Ложь) Экспорт

	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(Идентификатор, "specializationId");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Специализация = ПолучитьСсылку(Идентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Специализация) Тогда
		Возврат бит_омни_НеНайденаСпециализация();
	КонецЕсли;
	
	Если ВернутьСсылку Тогда
		Возврат Специализация;
	КонецЕсли;
	
	Реквизиты = Новый Структура("specializationId, specializationTitle", "ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Ссылка))", "Наименование");
	ТелоОтвета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Специализация, Реквизиты, Истина);
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);	

КонецФункции

Функция бит_омни_НеНайденаСпециализация()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("specialization_not_found", 404);	

КонецФункции

Функция бит_омни_ПреобразоватьВJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт

	Если Свойство = "iconCode" Тогда
		ИконкиСпециализаций = бит_омни_ОбщегоНазначенияПовтИсп.СоответствиеИзПеречисления("бит_омни_ИконкиСпециализаций", Истина);
		Значение = ИконкиСпециализаций.Получить(Значение);
		Если Значение = Неопределено Тогда
			Значение = "default";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;

КонецФункции
