Функция ВозможныеТипыДокументов() Экспорт
	
	Перем ВозможныеТипыДокументов;
	
	ВозможныеТипыДокументов = Новый Массив;
	ВозможныеТипыДокументов.Добавить("document");
	ВозможныеТипыДокументов.Добавить("audio");
	ВозможныеТипыДокументов.Добавить("voice");
	ВозможныеТипыДокументов.Добавить("animation");
	ВозможныеТипыДокументов.Добавить("sticker");
	ВозможныеТипыДокументов.Добавить("video");
	ВозможныеТипыДокументов.Добавить("video_note");
	Возврат ВозможныеТипыДокументов;

КонецФункции

Функция ОбработчикПолучателей(ТипДокумента) Экспорт

	соотОбработчиковПолучателей = СоответствиеОбработчиковПолучателей();
	Возврат соотОбработчиковПолучателей.Получить(ТипДокумента);

КонецФункции

Функция СоответствиеОбработчиковПолучателей() Экспорт

	Соответствие = Новый Соответствие;
	//Соответствие.Вставить("Документ.Заявка", "ПолучателиЗаявки");
	
	Возврат Соответствие; 
	
КонецФункции