Функция бит_омни_ДанныеДокументов(HTTPЗапрос) Экспорт
	
	ИдентификаторСотрудника = HTTPЗапрос.ПараметрыЗапроса.Получить("doctorId");
	ИдентификаторФилиала = HTTPЗапрос.ПараметрыЗапроса.Получить("branchId");
	ДатаЗаписи = HTTPЗапрос.ПараметрыЗапроса.Получить("date");
	Формат = HTTPЗапрос.ПараметрыЗапроса.Получить("format");
	
	Если Формат = Неопределено Тогда
		Возврат НеопределенФормат();
	ИначеЕсли Формат = "OnlyDate" Тогда
		Возврат бит_омни_ДатыРасписания(ИдентификаторСотрудника, ИдентификаторФилиала);		
	ИначеЕсли Формат = "Full" Тогда
		Возврат бит_омни_РасписаниеНаДень(ИдентификаторСотрудника, ИдентификаторФилиала, ДатаЗаписи);
	Иначе
		Возврат НеверныйФормат();
	КонецЕсли;

КонецФункции      

Функция НеопределенФормат()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("format_required");

КонецФункции

Функция НеверныйФормат()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("invalid_format");

КонецФункции

Функция бит_омни_ДатыРасписания(ИдентификаторСотрудника, ИдентификаторФилиала)

	Сотрудник = Справочники.Сотрудники.бит_омни_СотрудникПоUUID(ИдентификаторСотрудника, Истина);
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат Сотрудник; // если тип другой, то это HTTPСервисОтвет
	КонецЕсли;
	
	Филиал = Справочники.Филиалы.бит_омни_ФилиалПоUUID(ИдентификаторФилиала, Истина);
	
	Если ТипЗнч(Филиал) <> Тип("СправочникСсылка.Филиалы") Тогда
		Возврат Филиал; // если тип другой, то это HTTPСервисОтвет
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Сегодня = НачалоДня(ТекущаяДата);
	ДатаОкончания = КонецДня(ДобавитьМесяц(Сегодня, 1));
	Сотрудники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник);

	ДанныеГрафика = СформироватьТаблицыДляОбщегоГрафика(
		Сегодня,
		ДатаОкончания,
		Филиал,
		Сотрудники,
		,
		,
		бит_омни_ВыгружаемыеВидыВремени());

	ДлительностьПриема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ДлительностьПриема");
	ДлительностьПриемаВСекундах = ОбщегоНазначения.ВремяВСекунды(ДлительностьПриема);
	ТелоОтвета = Новый Массив;

	Для Каждого Интервал Из ДанныеГрафика.ТаблицаГрафиков Цикл
		НачалоСвободногоИнтервала = Интервал.ВремяНачала;
		Если НачалоДня(Интервал.Дата) = Сегодня И НачалоСвободногоИнтервала < ТекущаяДата Тогда
			НачалоСвободногоИнтервала = ТекущаяДата;
		КонецЕсли;

		ДатаИнтервала = НачалоДня(Интервал.Дата);
		Если Интервал.ВремяОкончания - НачалоСвободногоИнтервала >= ДлительностьПриемаВСекундах
			И ТелоОтвета.Найти(ДатаИнтервала) = Неопределено Тогда
			ТелоОтвета.Добавить(ДатаИнтервала);
		КонецЕсли;
	КонецЦикла;
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);

КонецФункции

Функция бит_омни_РасписаниеНаДень(ИдентификаторСотрудника, ИдентификаторФилиала, ДатаЗаписи)

	Сотрудник = Справочники.Сотрудники.бит_омни_СотрудникПоUUID(ИдентификаторСотрудника, Истина);
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат Сотрудник; // если тип другой, то это HTTPСервисОтвет
	КонецЕсли;
	
	Филиал = Справочники.Филиалы.бит_омни_ФилиалПоUUID(ИдентификаторФилиала, Истина);
	
	Если ТипЗнч(Филиал) <> Тип("СправочникСсылка.Филиалы") Тогда
		Возврат Филиал; // если тип другой, то это HTTPСервисОтвет
	КонецЕсли;
	
	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьДату(ДатаЗаписи, "date");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Графики.Сотрудник КАК Сотрудник,
	|	Графики.Дата КАК Дата,
	|	Графики.ВремяНачала КАК ВремяНачала,
	|	Графики.ВремяОкончания КАК ВремяОкончания,
	|	Графики.ВидВремени КАК ВидВремени,
	|	Графики.Филиал КАК Филиал,
	|	Графики.Кабинет КАК Кабинет,
	|	Графики.ВидВремени В (&ВыгружаемыеВидыВремени) КАК ЭтоРабочееВремя,
	|	NULL КАК ЗаявкаСсылка
	|ПОМЕСТИТЬ ВтГрафикиРаботы
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК Графики
	|ГДЕ
	|	Графики.Дата = &ДатаЗаписи
	|	И Графики.Сотрудник = &Сотрудник
	|	И Графики.Филиал = &Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА Заявка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(Заявка.ДатаНачала, ДЕНЬ) КАК Дата,
	|	ЗаявкаРаботы.ДатаНачала КАК ВремяНачала,
	|	ЗаявкаРаботы.ДатаОкончания КАК ВремяОкончания,
	|	НЕОПРЕДЕЛЕНО КАК ВидВремени,
	|	Заявка.Филиал КАК Филиал,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Оборудование1 = ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|			ТОГДА Заявка.Кабинет
	|		ИНАЧЕ ЗаявкаРаботы.Оборудование1
	|	КОНЕЦ КАК Кабинет,
	|	ЛОЖЬ КАК ЭтоРабочееВремя,
	|	Заявка.Ссылка КАК ЗаявкаСсылка
	|ПОМЕСТИТЬ ВтЗаявки
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.Работы КАК ЗаявкаРаботы
	|		ПО Заявка.Ссылка = ЗаявкаРаботы.Ссылка
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Заявка.ДатаНачала, ДЕНЬ) = &ДатаЗаписи
	|	И НЕ Заявка.ПометкаУдаления
	|	И Заявка.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаявок.Отменена)
	|	И (ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				И Заявка.Сотрудник = &Сотрудник
	|			ИЛИ ЗаявкаРаботы.Сотрудник = &Сотрудник)
	|	И Заявка.Филиал = &Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Графики.ВремяНачала КАК time_begin,
	|	Графики.ВремяОкончания КАК time_end,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Графики.Кабинет)) КАК cabinetId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Графики.Кабинет) КАК cabinetTitle,
	|	Графики.ЭтоРабочееВремя КАК isWorkTime,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))) КАК appointmentId
	|ИЗ
	|	ВтГрафикиРаботы КАК Графики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявки.ВремяНачала,
	|	Заявки.ВремяОкончания,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Заявки.Кабинет)),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Заявки.Кабинет),
	|	Заявки.ЭтоРабочееВремя,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Заявки.ЗаявкаСсылка))
	|ИЗ
	|	ВтЗаявки КАК Заявки
	|
	|УПОРЯДОЧИТЬ ПО
	|	time_begin,
	|	time_end";
	
	Запрос.УстановитьПараметр("ВыгружаемыеВидыВремени",  бит_омни_ВыгружаемыеВидыВремени());
	Запрос.УстановитьПараметр("ДатаЗаписи",  ДатаЗаписи);
	Запрос.УстановитьПараметр("Сотрудник",  Сотрудник);
	Запрос.УстановитьПараметр("Филиал",  Филиал);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	
	ТелоОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеЗапроса);
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);
	
КонецФункции

Функция бит_омни_ВыгружаемыеВидыВремени()
	
	//TODO сделать настройку ВыгружаемыеВидыВремени
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВремениГрафика.РабочееВремя);

КонецФункции // ВыгружаемыеВидыВремени()

Функция СформироватьТаблицыДляОбщегоГрафика(ДатаНачала, ДатаОкончания, Филиал = Неопределено, Сотрудники = Неопределено, 
											ИсключаемыеЗаявки = Неопределено, ТребуетсяПроверкаЭталонуДлительности = Истина, ВидыВыгружаемогоВремени = Неопределено, 
											Укрупненный = Ложь, ВернутьНулевуюДату = Ложь, РазличатьВидыВремени = Ложь) Экспорт
	
	Перем ТаблицаГрафиков, ТаблицаЗаявок;
	
	Если Укрупненный Тогда
		ТаблицаЗаявок	 = Новый ТаблицаЗначений;
		ТаблицаНерабочее = Новый ТаблицаЗначений;
	Иначе
		ТаблицаЗаявок = ПолучитьЗаявкиСотрудниковЗаПериод(ДатаНачала, ДатаОкончания, Филиал, ИсключаемыеЗаявки, ВернутьНулевуюДату, Сотрудники);
	КонецЕсли;
	
	ТаблицаГрафиков = ГрафикиСотрудников.ПолучитьРабочееВремяЗаПериод(ДатаНачала, ДатаОкончания, ВернутьНулевуюДату, РазличатьВидыВремени, Филиал, Сотрудники, ВидыВыгружаемогоВремени);
	
	Если Не Укрупненный Тогда	
		ГрафикиСотрудников.ВычестьПериодыИзТаблицыГрафика(ТаблицаГрафиков, ТаблицаЗаявок, ТребуетсяПроверкаЭталонуДлительности);
	КонецЕсли;
	
	ТаблицаГрафиков.Сортировать("Сотрудник, Дата, ВремяНачала");
	
	Если Не Укрупненный Тогда
		ТаблицаЗаявок.Сортировать("Сотрудник, Дата, ВремяНачала");
		
		// Склеим временные интервалы заявок
		Если ТаблицаЗаявок.Количество() >=2 Тогда 
			Сч = 1;
			фИндексВПределахМассива = Истина;
			Пока фИндексВПределахМассива Цикл
				ТекущийЭлементМассива		= ТаблицаЗаявок[Сч];
				ПредыдущийЭлементМассива	= ТаблицаЗаявок[Сч-1]; 			
				Если ТекущийЭлементМассива.Сотрудник		= ПредыдущийЭлементМассива.Сотрудник
					И ТекущийЭлементМассива.ВремяНачала		= ПредыдущийЭлементМассива.Времяокончания
					И ТекущийЭлементМассива.Дата			= ПредыдущийЭлементМассива.Дата
				Тогда
					ПредыдущийЭлементМассива.ВремяОкончания = ТекущийЭлементМассива.ВремяОкончания;
					ТаблицаЗаявок.Удалить(Сч);
				Иначе
					Сч = Сч+1;
				КонецЕсли;
				
				фИндексВПределахМассива = ? (Сч <= (ТаблицаЗаявок.Количество()- 1), Истина, Ложь );
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Подготовим таблицу с данными по каждому сотруднику из графика
	ТаблицаСотрудников = ТаблицаГрафиков.Скопировать();
	ТаблицаСотрудников.Свернуть	("Сотрудник, Филиал");
	ТаблицаСотрудников.Колонки.Добавить("СотрудникID");
	ТаблицаСотрудников.Колонки.Добавить("СотрудникФИО");
	ТаблицаСотрудников.Колонки.Добавить("Специализация");
	ТаблицаСотрудников.Колонки.Добавить("ФилиалУИД");
	ТаблицаСотрудников.Колонки.Добавить("СрДлительностьПриема");
	Для Каждого стр Из ТаблицаСотрудников Цикл
		стр.СотрудникID	 = Строка(стр.Сотрудник.УникальныйИдентификатор());
		стр.СотрудникФИО = стр.Сотрудник.Наименование;
		стр.ФилиалУИД	 = стр.Филиал.УникальныйИдентификатор();
		
		Если стр.Сотрудник.Метаданные().Реквизиты.Найти("Специализация") <> Неопределено Тогда
			стр.Специализация	= стр.Сотрудник.Специализация.Наименование;
		Иначе
			стр.Специализация	= "";
		КонецЕсли;
		
		Если ТипЗнч(стр.Сотрудник) = Тип("СправочникСсылка.Сотрудники")
			И стр.Сотрудник.ДлительностьПриема <> '00010101000000' 
		Тогда
			стр.СрДлительностьПриема = стр.Сотрудник.ДлительностьПриема;
		ИначеЕсли стр.Сотрудник.Метаданные().Реквизиты.Найти("Специализация") <> Неопределено И стр.Сотрудник.Специализация.ДлительностьПриема <> '00010101000000' Тогда
			стр.СрДлительностьПриема = стр.Сотрудник.Специализация.ДлительностьПриема;	
		Иначе
			БазоваяПериодичность = УправлениеНастройками.ПолучитьУчетнуюПолитику(ТекущаяДата()).ПериодичностьПланирования;
			стр.СрДлительностьПриема = БазоваяПериодичность;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура ("ТаблицаГрафиков, ТаблицаСотрудников, ТаблицаЗаявок", ТаблицаГрафиков, ТаблицаСотрудников, ТаблицаЗаявок);
	
КонецФункции

Функция ПолучитьЗаявкиСотрудниковЗаПериод(ДатаНачала, ДатаОкончания, Филиал, ИсключаемыеЗаявки = Неопределено, ВернутьНулевуюДату = Ложь, Сотрудники = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.ВремяНачала КАК ВремяНачала,
	               |	ВложенныйЗапрос.ВремяОкончания КАК ВремяОкончания,
	               |	ВложенныйЗапрос.Дата КАК Дата,
	               |	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.Клиника
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |					И (НЕ ЗаявкаРаботы.Номенклатура.ПланируетсяБезСотрудника
	               |						ИЛИ ЗаявкаРаботы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	               |				ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	               |			ИНАЧЕ ЗаявкаРаботы.Сотрудник
	               |		КОНЕЦ КАК Сотрудник,
	               |		%ВремяНачалаОкончания%
	               |		НАЧАЛОПЕРИОДА(ЗаявкаРаботы.ДатаНачала, ДЕНЬ) КАК Дата,
				   |		ЗаявкаРаботы.Ссылка.Филиал.Наименование КАК Клиника
	               |	ИЗ
	               |		Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |	ГДЕ
	               |		ЗаявкаРаботы.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |		И НЕ ЗаявкаРаботы.Ссылка.ПометкаУдаления
	               |		И НЕ ЗаявкаРаботы.Ссылка В (&ИсключаемыеЗаявки)
	               |		И (ЗаявкаРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидысостоянийЗаявок.ПустаяСсылка)
	               |				ИЛИ ЗаявкаРаботы.Ссылка.Состояние.ТипСостояния <> ЗНАЧЕНИЕ(Перечисление.ТипыСостоянийЗаявок.Отменена))
	               |		%УсловиеФилиал% %УсловиеСотрудники% И ЗаявкаРаботы.Ссылка.ДатаОкончания > ЗаявкаРаботы.Ссылка.ДатаНачала) КАК ВложенныйЗапрос
	               |";
	
	// К заявкам добавлены нерабочие периоды графика для исключения из свободного рабочего времени	.
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ИсключаемыеЗаявки", ИсключаемыеЗаявки);
	
	Если Филиал <> Неопределено И Не Филиал.Пустая() Тогда                                                                                             	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеФилиал%", "И ЗаявкаРаботы.Ссылка.Филиал  = &Филиал");
		Запрос.УстановитьПараметр("Филиал", Филиал);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеФилиал%", "");
	КонецЕсли;	

	Если Сотрудники <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСотрудники%", "И ЗаявкаРаботы.Ссылка.Сотрудник В (&Сотрудники)");
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСотрудники%", "");
	КонецЕсли;
	
	Если Не ВернутьНулевуюДату Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ВремяНачалаОкончания%",
		"	ДатаНачала КАК ВремяНачала,
	  	|	ДатаОкончания КАК ВремяОкончания,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ВремяНачалаОкончания%",
		"ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДатаНачала, ДЕНЬ), ДатаНачала, СЕКУНДА)) КАК ВремяНачала,
		|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДатаОкончания, ДЕНЬ), ДатаОкончания, СЕКУНДА)) КАК ВремяОкончания,");
	КонецЕсли;

	ТаблицаЗаявок = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗаявок;
	
КонецФункции

