
&НаСервере
Процедура бит_омни_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаБИТМедицинаОмни = Элементы.Вставить("бит_омни_ГруппаЭлементов", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаБИТМедицинаОмни.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаБИТМедицинаОмни.Заголовок = "БИТ.Медицина / Омни";
	
	ЭлементТипЗаписи = Элементы.Добавить("бит_омни_ЗаголовокДляВыгрузки", Тип("ПолеФормы"), ГруппаБИТМедицинаОмни);
	ЭлементТипЗаписи.ПутьКДанным = "Объект.бит_омни_ЗаголовокДляВыгрузки";
	ЭлементТипЗаписи.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры
