Функция бит_омни_ОборудованиеПоUUID(Знач Идентификатор, ВернутьСсылку = Ложь) Экспорт

	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(Идентификатор, "cabinetId");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Оборудование = ПолучитьСсылку(Идентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Оборудование) Тогда
		Возврат бит_омни_НеНайденоОборудование();
	КонецЕсли;
	
	Если ВернутьСсылку Тогда
		Возврат Оборудование;
	КонецЕсли;
	
	Реквизиты = Новый Структура("cabinetId, cabinetTitle", "ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Ссылка))", "Наименование");
	ТелоОтвета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Оборудование, Реквизиты, Истина);
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);	

КонецФункции

Функция бит_омни_НеНайденоОборудование()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("cabinet_not_found", 404);	

КонецФункции


