#Область ПрограммныйИнтерфейс

Процедура СправочникиПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("бит_омни_НеПроверять") Тогда
		Возврат;
	КонецЕсли;
	
	Рассылки = ПроверитьРассылки(Источник);
	
	Если Рассылки <> Неопределено Тогда
		
		Для Каждого Рассылка Из Рассылки Цикл
			НоваяЗапись = Рассылка.ПередЗаписью.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник.Ссылка);
		КонецЦикла;
		
		Источник.ДополнительныеСвойства.Вставить("бит_омни_Рассылки", Рассылки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт

	Если Источник.ДополнительныеСвойства.Свойство("бит_омни_Рассылки") Тогда
		
		Рассылки = Источник.ДополнительныеСвойства.бит_омни_Рассылки;
		
		МодульСхемыКомпоновки = ОбщегоНазначения.ОбщийМодуль("бит_омни_СхемыКомпоновки"); 
		Для Каждого Рассылка Из Рассылки Цикл
			
			НоваяЗапись = Рассылка.ПриЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник);
			
			ТаблицаОбъединения = Новый ТаблицаЗначений;
			ТаблицаОбъединения = Рассылка.ПередЗаписью.Скопировать();
			
			Для Каждого Колонка Из ТаблицаОбъединения.Колонки Цикл
				Колонка.Имя = Колонка.Имя + "До";	
			КонецЦикла;
			
			Для Каждого Колонка Из Рассылка.ПриЗаписи.Колонки Цикл
				ТаблицаОбъединения.Колонки.Добавить(Колонка.Имя + "После", Колонка.ТипЗначения);
				ТаблицаОбъединения[0][Колонка.Имя + "После"] = НоваяЗапись[Колонка.Имя];
			КонецЦикла;
			
			СКДКонтекст = Рассылка.СКДКонтекст.ХранилищеСКД.Получить();
			НаборДанныхОбъединенный = СКДКонтекст.НаборыДанных.Найти("НаборДанныхОбъединенный");
			Если НаборДанныхОбъединенный = Неопределено Тогда
				НаборДанныхОбъединенный = СКДКонтекст.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
			КонецЕсли;
			НаборДанныхОбъединенный.Имя = "НаборДанныхОбъединенный"; 
			НаборДанныхОбъединенный.ИмяОбъекта = "НаборДанныхОбъединенный"; 
			НаборДанныхОбъединенный.ИсточникДанных = "ИсточникДанных1"; 
			Для Каждого Колонка Из ТаблицаОбъединения.Колонки Цикл
				
				Если НаборДанныхОбъединенный.Поля.Найти(Колонка.Имя) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Колонка.ТипЗначения = Тип("ТаблицаЗначений") Тогда
					Поле = НаборДанныхОбъединенный.Поля.Добавить(Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных"));
				Иначе
					Поле = НаборДанныхОбъединенный.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
					Поле.ТипЗначения = Колонка.ТипЗначения;
				КонецЕсли;
				
				Поле.Поле = Колонка.Имя;
				Поле.ПутьКДанным = Колонка.Имя;
				Поле.Заголовок = Колонка.Заголовок;
				
			КонецЦикла;
			
			НДПередЗаписью = СКДКонтекст.НаборыДанных.Найти("ПередЗаписью");
			НДПриЗаписи = СКДКонтекст.НаборыДанных.Найти("ПриЗаписи");
			
			Если НДПередЗаписью <> Неопределено Тогда
				СКДКонтекст.НаборыДанных.Удалить(НДПередЗаписью);	
			КонецЕсли;                                           
			
			Если НДПриЗаписи <> Неопределено Тогда
				СКДКонтекст.НаборыДанных.Удалить(НДПриЗаписи);	
			КонецЕсли;
			
			ПараметрыВыполнения = МодульСхемыКомпоновки.ПараметрыВыполненияСхемы("ТаблицаЗначений");
			ПараметрыВыполнения.ВнешниеНаборыДанных.Вставить("НаборДанныхОбъединенный", ТаблицаОбъединения);
			
			Контекст = МодульСхемыКомпоновки.ВыполнитьСхему(СКДКонтекст, ПараметрыВыполнения);
			ПолучателиТЗ = МодульСхемыКомпоновки.ВыполнитьСхему(Рассылка.СКДПолучатели, ПараметрыВыполнения);
			Получатели = ПолучателиТЗ.ВыгрузитьКолонку("Получатель");
			
			Если Контекст.Количество() > 0  Тогда
				бит_омни_ИнтеграцияСMAX.ОтправитьСообщение(Рассылка.Шаблон, Получатели, Рассылка.Бот, Контекст[0]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если Источник.ДополнительныеСвойства.Свойство("бит_омни_НеПроверять") Тогда
		Возврат;
	КонецЕсли;
	
	Рассылки = ПроверитьРассылки(Источник);
	
	Если Рассылки <> Неопределено Тогда
		
		Для Каждого Рассылка Из Рассылки Цикл
			НоваяЗапись = Рассылка.ПередЗаписью.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник.Ссылка);
		КонецЦикла;
		
		Источник.ДополнительныеСвойства.Вставить("бит_омни_Рассылки", Рассылки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьРассылкиПриЗаписиОбъекта() Экспорт
	
КонецПроцедуры

Функция ПроверитьРассылки(Источник)
	
	МетаОбъекта = Источник.Метаданные();
	ИмяОбъекта = МетаОбъекта.ПолноеИмя();
	
	Кеш = ПараметрыСеанса.бит_омни_КешОбъектовДляРассылки.Получить(); 
	
	Возврат Кеш.Получить(ИмяОбъекта);
	
КонецФункции

#КонецОбласти



