#Область ПрограммныйИнтерфейс

// СКД и алгоритмы выполняются worker вне медицинской транзакции.
Процедура СправочникиПередЗаписью(Источник, Отказ) Экспорт
	Источник.ДополнительныеСвойства.Удалить("бит_ПодготовкаРассылок");
	Если Отказ Или Источник.ОбменДанными.Загрузка
		Или ТипЗнч(Источник) = Тип("СправочникОбъект.ВариантыОтчетов")
		Или Источник.ДополнительныеСвойства.Свойство("бит_омни_НеПроверять") Тогда Возврат; КонецЕсли;
	бит_ПодготовкаУведомленийMAX.ЗафиксироватьДоЗаписи(Источник);
КонецПроцедуры

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Источник.ДополнительныеСвойства.Удалить("бит_ПодготовкаРассылок");
		Возврат;
	КонецЕсли;
	бит_ПодготовкаУведомленийMAX.ЗафиксироватьПослеЗаписи(Источник);
КонецПроцедуры

Процедура ДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Источник.ДополнительныеСвойства.Удалить("бит_ПодготовкаРассылок");
	Если Отказ Или Источник.ОбменДанными.Загрузка
		Или Источник.ДополнительныеСвойства.Свойство("бит_омни_НеПроверять") Тогда Возврат; КонецЕсли;
	бит_ПодготовкаУведомленийMAX.ЗафиксироватьДоЗаписи(Источник);
КонецПроцедуры

Процедура ОбработатьРассылкиПриЗаписиОбъекта() Экспорт
	бит_ПодготовкаУведомленийMAX.ВыполнитьПодготовку();
КонецПроцедуры

#КонецОбласти
