
&НаКлиенте
Процедура ОбработкаВыбораПодбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	Если Элемент = Элементы.Услуги Тогда
		ИмяТЧ = "Услуги";
		ИмяПоля = "Услуга";
	ИначеЕсли Элемент = Элементы.Сотрудники Тогда
		ИмяТЧ = "Сотрудники";
		ИмяПоля = "Сотрудник";
	ИначеЕсли Элемент = Элементы.Специализации Тогда
		ИмяТЧ = "Специализации";
		ИмяПоля = "Специализация";
	Иначе
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоля, ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() Тогда
			Возврат;
		КонецЕсли;  
		
		НоваяСтрока = Объект[ИмяТЧ].Добавить();
		НоваяСтрока[ИмяПоля] = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Отбор = Новый Структура("ПометкаУдаления, бит_омни_НеВыгружать", Ложь, Ложь);
	Если Команда.Имя = "ПодборНоменклатуры" Тогда
		ИмяСправочника = "Номенклатура";
		ТекущийЭлемент = Элементы.Услуги;
		Отбор.Вставить("ВидНоменклатура", ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга"));
	ИначеЕсли Команда.Имя = "ПодборСотрудников" Тогда
		ИмяСправочника = "Сотрудники";
		ТекущийЭлемент = Элементы.Сотрудники;
	ИначеЕсли Команда.Имя = "ПодборСпециализации" Тогда
        ИмяСправочника = "КатегорииВыработки";
		ТекущийЭлемент = Элементы.Специализации;
	Иначе
		Возврат;
	КонецЕсли;                      
	
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриВыборе, РежимВыбора", Отбор, Ложь, Истина);
	
	ИмяФормыСправочника = СтрШаблон("Справочник.%1.ФормаВыбора", ИмяСправочника);
	ОткрытьФорму(ИмяФормыСправочника, ПараметрыФормы, ТекущийЭлемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
