#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мсПараметров = Объект.Параметры.Выгрузить().ВыгрузитьКолонку("ИмяПараметра");
	ПараметрыАлгоритма.ЗагрузитьЗначения(мсПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Параметры.Очистить();

	Для Каждого Параметр Из ПараметрыАлгоритма Цикл
		НоваяСтрока = ТекущийОбъект.Параметры.Добавить();
		НоваяСтрока.ИмяПараметра = Параметр.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти