#Область ПрограммныйИнтерфейс

Функция бит_омни_ДанныеТранзакций(HTTPЗапрос) Экспорт

	ТелоЗапроса = бит_омни_ИнтеграцияСервер.ТелоЗапросаВСтруктуру(HTTPЗапрос);
	Если НЕ ТелоЗапроса.Свойство("patient_id") Тогда
		Возврат Справочники.Клиенты.бит_омни_НеопределенИдентификатор();
	КонецЕсли;                                      
	
	Клиент = Справочники.Клиенты.бит_омни_ПациентПоUUID(ТелоЗапроса.patient_id, Истина);
	
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.Клиенты") Тогда
		Возврат Клиент; // функция может вернуть только HTTPСервисОтвет или СправочникСсылка.Клиенты
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	НакопленияПоСкидкам.Период КАК date,
	|	ВЫБОР
	|		КОГДА НакопленияПоСкидкам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НакопленияПоСкидкам.Регистратор ССЫЛКА Документ.ОказаниеУслуг
	|			ТОГДА ""Покупка""
	|		КОГДА НакопленияПоСкидкам.Регистратор ССЫЛКА Документ.ОказаниеУслуг
	|			ТОГДА ""Кешбэк за покупку""
	|		КОГДА НакопленияПоСкидкам.Регистратор ССЫЛКА Документ.СписаниеБонусов
	|				И ВЫРАЗИТЬ(НакопленияПоСкидкам.Регистратор КАК Документ.СписаниеБонусов).Комментарий <> """"
	|			ТОГДА ВЫРАЗИТЬ(НакопленияПоСкидкам.Регистратор КАК Документ.СписаниеБонусов).Комментарий
	|		КОГДА НакопленияПоСкидкам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ""Прочие списания""
	|		ИНАЧЕ ""Прочие начисления""
	|	КОНЕЦ КАК description,
	|	ВЫБОР
	|		КОГДА НакопленияПоСкидкам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ""debit""
	|		ИНАЧЕ ""credit""
	|	КОНЕЦ КАК operation,
	|	НакопленияПоСкидкам.Накопление КАК Накопление,
	|	ВЫБОР
	|		КОГДА НакопленияПоСкидкам.Регистратор ССЫЛКА Документ.ОказаниеУслуг
	|				И НакопленияПоСкидкам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ВыработкаСотрудниковОбороты.СуммаБезСкидокОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК operation_sum,
	|	НакопленияПоСкидкам.Накопление КАК sum
	|ИЗ
	|	РегистрНакопления.НакопленияПоСкидкам КАК НакопленияПоСкидкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаСотрудников.Обороты(, , Регистратор, ) КАК ВыработкаСотрудниковОбороты
	|		ПО НакопленияПоСкидкам.Регистратор = ВыработкаСотрудниковОбороты.Регистратор
	|ГДЕ
	|	НакопленияПоСкидкам.Получатель = &Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НакопленияПоСкидкам.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	
	ТелоОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеЗапроса);
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);
	
КонецФункции

#КонецОбласти