Функция ОтветСОшибкой(ТекстОшибки, HTTPКод = 400, Описание = Неопределено) Экспорт
	
	Ответ = Новый HTTPСервисОтвет(HTTPКод);
	
	ТелоОтвета = Новый Структура("error", ТекстОшибки);                  
	Если ЗначениеЗаполнено(Описание) Тогда
		ТелоОтвета.Вставить("desc", Описание);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;             
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоОтвета);
	
	ТелоОтветаСтрокой = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(ТелоОтветаСтрокой);
	
	Возврат Ответ;

КонецФункции

Функция УспешныйОтвет(ТелоОтвета, ИмяФункцииПреобразования = Неопределено, МодульПреобразования = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоОтвета,, ИмяФункцииПреобразования, МодульПреобразования);
	ТелоСтрокой = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоСтрокой);
	
	Возврат Ответ;
	
КонецФункции

Функция ТелоЗапросаВСтруктуру(Запрос) Экспорт

	ТелоЗапросаСтрокой = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапросаСтрокой);
	ТелоЗапроса = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ТелоЗапроса;

КонецФункции

Функция ВалидироватьИдентификатор(Идентификатор, ИмяПоля) Экспорт

	Если Идентификатор = Неопределено Тогда
		Возврат ОтветСОшибкой(СтрШаблон("%1_required", ИмяПоля));	
	КонецЕсли;
	
	Попытка
		UUIDСсылки = Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));	
	КонецПопытки;                                
	
	Если UUIDСсылки = бит_омни_ОбщегоНазначения.ПустойUUID() Тогда
		Возврат ОтветСОшибкой(СтрШаблон("%1_empty", ИмяПоля));
	КонецЕсли;
	
	Идентификатор = UUIDСсылки;
	
	Возврат Неопределено;
	
КонецФункции // ВалидироватьИдентификатор()

Функция ВалидироватьДату(ДатаISO, ИмяПоля, ВключаяВремя = Ложь) Экспорт

	ДатаРазбитая = СтрРазделить(ДатаISO, "T"); // Формат даты ISO вида: "ГГГГ-ММ-ДДTЧЧ:ММ:ССZ".
	Если ДатаРазбитая.Количество() = 0 Тогда
		Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));	
	КонецЕсли;
	
	ТолькоДата = ДатаРазбитая.Получить(0);
	ДатаПоЧастям = СтрРазделить(ТолькоДата, "-");
	
	Если ДатаПоЧастям.Количество() <> 3 Тогда
		Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));	
	КонецЕсли;

	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(4, 0, ДопустимыйЗнак.Неотрицательный);

	Если ВключаяВремя Тогда
		Если ДатаРазбитая.Количество() < 2 Тогда
			Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));	
		КонецЕсли;
		
		ТолькоВремя = ДатаРазбитая.Получить(1);
		ВремяПоЧастям = СтрРазделить(ТолькоВремя, ":");
		
		Если ВремяПоЧастям.Количество() <> 3 Тогда
			Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));
		КонецЕсли;                                                  
		Попытка
			ДатаISO = Дата(ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(0)), 
							ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(1)),
							ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(2)),
							ОписаниеТипаЧисло.ПривестиЗначение(ВремяПоЧастям.Получить(0)),
							ОписаниеТипаЧисло.ПривестиЗначение(ВремяПоЧастям.Получить(1)),
							ОписаниеТипаЧисло.ПривестиЗначение(ВремяПоЧастям.Получить(2)));
							
			Возврат Неопределено;
		Исключение
			Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		ДатаISO = Дата(ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(0)), 
						ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(1)),
						ОписаниеТипаЧисло.ПривестиЗначение(ДатаПоЧастям.Получить(2)));
	Исключение
		Возврат ОтветСОшибкой(СтрШаблон("invalid_%1", ИмяПоля));
	КонецПопытки;
	
    Возврат Неопределено;
	
КонецФункции