// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, то в случае "ВыбратьРазрешенные = Ложь" возникнет исключение прав доступа,
//  а в случае "ВыбратьРазрешенные = Истина" вернется значение Неопределено для всех реквизитов.
//
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Функция не предназначена для получения значений реквизитов пустых ссылок.
//
// Параметры:
//  МассивСсылок - Массив - массив ссылок на объекты одного типа.
//                 ВАЖНО! Значения массива должны быть ссылками на объекты ОДНОГО типа!
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                если выборка будет пустая, то все реквизиты вернутся со значением Неопределено;
//                                если Ложь, то возникнет исключение при отсутствии прав на любой из реквизитов.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура.
//              Если в качестве объекта передана пустая ссылка, то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	ИменаРеквизитов = "";
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		ИменаРеквизитов = Реквизиты;
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
		Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);	
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	Если ТипЗнч(Реквизиты) = Тип("Структура") Или ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		СтруктураРеквизитов = Реквизиты;
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив") Или ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(СтрЗаменить(Реквизит, ".", ""), Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
					  		  
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		ИменаРеквизитов = ИменаРеквизитов + ?(ПустаяСтрока(ИменаРеквизитов), "", ",") + Псевдоним;	
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.Текст =
	"ВЫБРАТЬ " + ?(ВыбратьРазрешенные, "РАЗРЕШЕННЫЕ", "") + "
	|	Ссылка КАК Ссылка, " + ТекстПолей + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка В (&МассивСсылок)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		ЗначенияРеквизитов.Вставить(Ссылка, Новый Структура(ИменаРеквизитов));
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов[Выборка.Ссылка], Выборка);
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция ПустойUUID() Экспорт

	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");

КонецФункции // ПустойUUID()

Функция ПолучитьСписокОбъектовДляРассылок() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_омни_РассылкиПринадлежность.Объект КАК Объект,
	|	бит_омни_Рассылки.Ссылка КАК Рассылка,
	|	бит_омни_Рассылки.Шаблон КАК Шаблон,
	|	бит_омни_Рассылки.СКДПолучатели КАК СКДПолучатели,
	|	бит_омни_Рассылки.СКДКонтекст КАК СКДКонтекст,
	|	бит_омни_АктивныеРассылки.Бот КАК Бот
	|ИЗ
	|	Справочник.бит_омни_Рассылки.Принадлежность КАК бит_омни_РассылкиПринадлежность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_омни_Рассылки КАК бит_омни_Рассылки
	|			ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_АктивныеРассылки КАК бит_омни_АктивныеРассылки
	|			ПО бит_омни_АктивныеРассылки.Рассылка = бит_омни_Рассылки.Ссылка
	|		ПО бит_омни_РассылкиПринадлежность.Ссылка = бит_омни_Рассылки.Ссылка
	|ГДЕ
	|	НЕ бит_омни_Рассылки.ПометкаУдаления
	|	И бит_омни_РассылкиПринадлежность.Объект <> """"
	|	И бит_омни_Рассылки.РежимРассылки = ЗНАЧЕНИЕ(Перечисление.бит_омни_РежимыРассылки.ПриЗаписиОбъекта)
	|ИТОГИ ПО
	|	Объект";
	
	ОбъектыДляРассылок = Новый Соответствие;
	ВыборкаОбъекты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОбъекты.Следующий() Цикл
		
		Массив = Новый Массив;
		ВыборкаРассылки = ВыборкаОбъекты.Выбрать();
		
		Пока ВыборкаРассылки.Следующий() Цикл
			
			Структура = Новый Структура("Рассылка, Шаблон, СКДПолучатели, СКДКонтекст, Бот");
          	ЗаполнитьЗначенияСвойств(Структура, ВыборкаРассылки);
			Структура.СКДПолучатели = ВыборкаРассылки.СКДПолучатели.Получить();
			Структура.СКДКонтекст = ВыборкаРассылки.СКДКонтекст.Получить();
			
			МодульСхемыКомпоновки = ОбщегоНазначения.ОбщийМодуль("бит_омни_СхемыКомпоновки");
			
			ПередЗаписью = МодульСхемыКомпоновки.ОписаниеНабораДанных(Структура.СКДКонтекст, "ПередЗаписью");
			ПриЗаписи = МодульСхемыКомпоновки.ОписаниеНабораДанных(Структура.СКДКонтекст, "ПриЗаписи");
			
			Структура.Вставить("ПередЗаписью", ПередЗаписью);
			Структура.Вставить("ПриЗаписи", ПриЗаписи);
			
			Массив.Добавить(Структура);
			
		КонецЦикла;                    
		
		ОбъектыДляРассылок.Вставить(ВыборкаОбъекты.Объект, Массив);
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ОбъектыДляРассылок);

КонецФункции

Функция ОписаниеТиповСхемыКомпоновкиДанных() Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.бит_омни_СхемыКомпоновкиДанных");
	
КонецФункции