Функция СоответствиеИзПеречисления(ИмяПеречисления, ОбратныйПорядок = Ложь) Экспорт

	Соответствие = Новый Соответствие;
	ЗаполнитьКоллекциюПеречислением(Соответствие, ИмяПеречисления, ОбратныйПорядок);
	
	Возврат Соответствие;

КонецФункции // СоответствиеИзПеречисления()


Процедура ЗаполнитьКоллекциюПеречислением(Коллекция, ИмяПеречисления, ОбратныйПорядок = Ложь)
	
	// Коллекция - Структура или Соответствие.
	ЗначенияПеречисленияМетаданные = Метаданные.Перечисления.Найти(ИмяПеречисления).ЗначенияПеречисления;
	Перечисление = Перечисления[ИмяПеречисления];
	
	Для Каждого МетаданныеЗначения Из ЗначенияПеречисленияМетаданные Цикл
		
		Если ОбратныйПорядок Тогда
			Коллекция.Вставить(Перечисление[МетаданныеЗначения.Имя], МетаданныеЗначения.Имя);
		Иначе
			Коллекция.Вставить(МетаданныеЗначения.Имя, Перечисление[МетаданныеЗначения.Имя]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры