Функция бит_омни_ДанныеСправочника(Запрос) Экспорт

	ТипПоиска = Запрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ВсеФилиалы();	
	ИначеЕсли ТипПоиска = "ByID" Тогда
		Идентификатор = Запрос.ПараметрыЗапроса.Получить("branchId");
		Возврат бит_омни_ФилиалПоUUID(Идентификатор);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции

Функция бит_омни_ФилиалПоUUID(Знач Идентификатор, ВернутьСсылку = Ложь) Экспорт

	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(Идентификатор, "branchId");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Филиал = ПолучитьСсылку(Идентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Филиал) Тогда
		Возврат бит_омни_НеНайденФилиал();
	КонецЕсли;
	
	Если ВернутьСсылку Тогда
		Возврат Филиал;
	КонецЕсли;
	
	Реквизиты = Новый Структура("branchId, branchTitle", "ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Ссылка))", "Наименование"); 
	ТелоОтвета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Филиал, Реквизиты, Истина);
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);

КонецФункции

Функция бит_омни_ВсеФилиалы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Филиалы.Ссылка)) КАК branchId,
	               |	Филиалы.Наименование КАК branchTitle
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы
	               |ГДЕ
	               |	НЕ Филиалы.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	branchTitle";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	
	ТелоОтвета = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеЗапроса);
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоОтвета);

КонецФункции // бит_омни_ВсеФилиалы()


Функция бит_омни_НеНайденФилиал()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("branch_not_found", 404);	

КонецФункции


