#Область ПрограммныйИнтерфейс

// Возвращает значение константы по указанному идентификатору.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//  Разрез  - РегистрыСведений.бит_омни_ЗначенияНастроек.Разрез.Тип - Разрез значения константы (необязательный).
//
// Возвращаемое значение:
//   Произвольный - Значение константы.
//
Функция ЗначениеКонстанты(Идентификатор, Разрез = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ЗначениеКонстанты(Идентификатор, Разрез);
КонецФункции

// Возвращает значения констант по указанным идентификаторам.
//
// Параметры:
//  ИдентификаторыСтрокой  - Строка - Идентификаторы констант строкой, разделенные ", ".
//
// Возвращаемое значение:
//   Структура:
//     * Ключ - Идентификатор константы.
//     * Значение - Произвольный - Значение константы.
//
Функция ЗначенияКонстант(ИдентификаторыСтрокой) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ЗначенияКонстант(ИдентификаторыСтрокой);
КонецФункции

// Возвращает признак - используется ли функциональная опция.
//  Под функциональной опцией здесь понимаем дополнительные константы с типом значения "Булево".
//  Считается, что Функциональная опция используется, в случае, если найдено 
//  хотя бы одно значение константы, установленное в ИСТИНА.
//  Например, если константу задаем в разрезе организаций, то считаем, что
//  ФО используется, если установлено ИСТИНА хотябы по одной организации.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   Булево - Признак использования ФО.
//
Функция ФункциональнаяОпцияИспользуется(Идентификатор) Экспорт	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегистрыСведений.бит_омни_ЗначенияНастроек.ФункциональнаяОпцияИспользуется(Идентификатор);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание константы.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - Строка таблицы описания констант, в которой содержится полная информация о константе.
//   	Описание колонок строки таблицы см. в НовыйТаблицаОписанияКонстант().
//
Функция ОписаниеКонстанты(Идентификатор) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.бит_омни_Настройки.ОписаниеКонстанты(Идентификатор);
КонецФункции

// Возвращает таблицу полного описания констант.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица описания констант, в которой содержится полная информация о всех актуальных константах.
//   	Описание колонок таблицы см. в Справочники.бит_омни_Настройки.НовыйТаблицаОписанияКонстант().
Функция ТаблицаОписанияКонстант() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Справочники.бит_омни_Настройки.ТаблицаОписанияКонстант();
КонецФункции


// Функция - Получить настройку пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, настройку которого нужно получить, 
//		если не указан - используется ПараметрыСеанса.ТекущийПользователь
//  Настройка	 - ПланВидовХарактеристикСсылка.НастройкиПользователей - Настройка, которую нужно получить
// 
// Возвращаемое значение:
//   Произвольный - Данные из регистра сведений НастройкиПользователей с отбором по пользователю и настройке
//
Функция ПолучитьНастройкуПользователя(Пользователь = Неопределено, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	НЗНастройки = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	НЗНастройки.Отбор.Пользователь.Установить(Пользователь);
	НЗНастройки.Отбор.Настройка.Установить(Настройка);
	НЗНастройки.Прочитать();
	
	Если НЗНастройки.Количество() Тогда
		
		Возврат НЗНастройки.Получить(0).Значение;
		
	КонецЕсли;
		
	Возврат Настройка.ТипЗначения.ПривестиЗначение(Неопределено);
		
КонецФункции

#КонецОбласти

