
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Схема", Схема);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Сформировать();

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

	Сформировать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	СхемаКомпоновки = ПолучитьСхемуКомпоновки(Схема);  
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);
    ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	ОбработкаРасшифровки.ПоказатьВыборДействия(Новый ОписаниеОповещения("ВыполнитьРасшифровку", ЭтаФорма), Расшифровка, ДоступныеДействия, , Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда = Неопределено)

	СформироватьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	ПараметрыВыполнения = бит_омни_СхемыКомпоновки.ПараметрыВыполненияСхемы();
	ПараметрыВыполнения.ИдентификаторФормы = УникальныйИдентификатор;
	ДокументРезультат = бит_омни_СхемыКомпоновки.ВыполнитьСхему(Схема, ПараметрыВыполнения, ДанныеРасшифровки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСхемуКомпоновки(Схема)

	Возврат Схема.ХранилищеСКД.Получить();

КонецФункции

&НаКлиенте
Процедура ВыполнитьРасшифровку(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт

	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда                                    
		ПоказатьЗначение(, ПараметрВыполненногоДействия);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти








